app/controllers/api/v1/scheduling_controller.rb

  def channels
    headers['Access-Control-Allow-Origin'] = '*'
    date = params[:date] || Date.today
    channels = Channel.where("valid_to is null or valid_to >= ?", date).order(:NAME)
---
SELECT `CHANNELS`.* FROM `CHANNELS` WHERE (valid_to is null or valid_to >= '2016-06-09')  ORDER BY `CHANNELS`.`NAME` ASC

  def cities
    headers['Access-Control-Allow-Origin'] = '*'
    cities = City.order(:NAME)
---
SELECT `CITIES`.* FROM `CITIES` WHERE (valid_to is null or valid_to >= '2015-01-01')  ORDER BY `CITIES`.`NAME` ASC

  def filler_captions
    headers['Access-Control-Allow-Origin'] = '*'
    channel_id = params[:channel_code]

    filler_captions = FillerCaption.where("CHANNEL_ID = ?", channel_id)
---
SELECT `FILLER_CAPTIONS`.* FROM `FILLER_CAPTIONS` WHERE (CHANNEL_ID = 'ZN')

  def signature_captions
    headers['Access-Control-Allow-Origin'] = '*'
    channel_code = params[:channel_code]
    date = params[:date]

    file_name = RoSpotDetail.where("SCH_DATE = ?", date).joins("inner join RO_CAMPAIGN_DETAILS on RO_SPOT_DETAILS.RO_CAMPAIGN_DETAILS_ID = RO_CAMPAIGN_DETAILS.ID").where("CHANNEL_CODE = ?", channel_code).maximum("RO_CAMPAIGN_DETAILS.FILE_NAME")
    ro_signature_captions = RoSignatureCaption.where("FILE_NAME = ?", file_name).order("SLOT_NUMBER")
    signature_to_captions_map = {}
    ro_signature_captions.each do |ro_signature_caption|
      signature = ro_signature_caption.SIGNATURE
      caption_id = ro_signature_caption.CAPTION_ID
      captions = signature_to_captions_map[signature]
      if captions.nil?
        captions = []
        signature_to_captions_map[signature] = captions
      end
      captions.push caption_id
    end

    sig_to_duration_map = {}
    ro_spot_details = RoSpotDetail.where("SCH_DATE = ?", date).includes(:RoCampaignDetail).select { |e| e.RoCampaignDetail and e.RoCampaignDetail.CHANNEL_CODE == channel_code }
---
SELECT MAX(RO_CAMPAIGN_DETAILS.FILE_NAME) FROM `RO_SPOT_DETAILS` inner join RO_CAMPAIGN_DETAILS on RO_SPOT_DETAILS.RO_CAMPAIGN_DETAILS_ID = RO_CAMPAIGN_DETAILS.ID WHERE (SCH_DATE = '2016-06-09') AND (CHANNEL_CODE = 'ZN')
SELECT `RO_SIGNATURE_CAPTIONS`.* FROM `RO_SIGNATURE_CAPTIONS` WHERE (FILE_NAME = 'TBR-Beta/ReleaseOrder/ZN/2016/06-June/ZEENEWS_MasterRO_June 2016.xls')  ORDER BY SLOT_NUMBER
SELECT `RO_CAMPAIGN_DETAILS`.* FROM `RO_CAMPAIGN_DETAILS` WHERE `RO_CAMPAIGN_DETAILS`.`ID` IN (176523, 177283, 177285, 177286, 177287, 177346, 177347, 177348, 177349, 177350, 177613, 177614, 177615, 177616, 177617, 177618, 177619, 177620, 177621, 177622, 177623, 177624, 177679, 177681, 177682, 177687)
SELECT `RO_SPOT_DETAILS`.* FROM `RO_SPOT_DETAILS` WHERE (SCH_DATE = '2016-06-09')